ivy-read.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-05 Wed 23:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creating simple ivy-read macros</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T. Gustafsson" />
<link rel="stylesheet" type="text/css" href="org2.css" />
</head>
<body>
<div id="content">
<h1 class="title">Creating simple ivy-read macros</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6b9fdee">1. Introduction</a></li>
<li><a href="#org7d267bd">2. Basics</a></li>
<li><a href="#org2c170fa">3. Programmatic generation of candidates</a></li>
<li><a href="#org0618871">4. What to do with the result?</a></li>
<li><a href="#orge75377f">5. "Real world" example</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6b9fdee" class="outline-2">
<h2 id="org6b9fdee"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
For Emacs there exists a third-party package for interactive selection of
candidates called <a href="https://github.com/abo-abo/swiper">ivy</a>.  It's quite easy to create custom tools that use ivy's
fuzzy matching algorithms.
</p>
</div>
</div>

<div id="outline-container-org7d267bd" class="outline-2">
<h2 id="org7d267bd"><span class="section-number-2">2</span> Basics</h2>
<div class="outline-text-2" id="text-2">
<p>
The command <code>ivy-read</code> takes a minimum of two arguments:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(ivy-read <span style="color: #ff1f8b;">"prompt: "</span> '(<span style="color: #ff1f8b;">"foo"</span> <span style="color: #ff1f8b;">"bar"</span> <span style="color: #ff1f8b;">"baz"</span>))
</pre>
</div>

<p>
This allows selecting any candidate from the list <code>'("foo" "bar" "baz")</code>.
</p>

<p>
<b>Hint!</b> You can try these commands in Emacs by opening <code>*scratch*</code> buffer,
typing in any of the Emacs Lisp commands, and pressing <code>C-x C-e</code> while having
the point at the final closing parenthesis.
</p>
</div>
</div>

<div id="outline-container-org2c170fa" class="outline-2">
<h2 id="org2c170fa"><span class="section-number-2">3</span> Programmatic generation of candidates</h2>
<div class="outline-text-2" id="text-3">
<p>
Many interesting commands, such as <code>ivy-switch-buffer</code> and <code>counsel-M-x</code>,
generate the candidate list dynamically when the command is first invoked.  You
can use any Emacs Lisp features to create a list of strings and pass it to
<code>ivy-read</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #b2b2b2; font-style: italic;">; </span><span style="color: #b2b2b2; font-style: italic;">Select a filename from the current directory</span>
(ivy-read <span style="color: #ff1f8b;">"pick file: "</span>
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> (split-string
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  (shell-command-to-string <span style="color: #ff1f8b;">"ls"</span>) <span style="color: #ff1f8b;">"\n"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0618871" class="outline-2">
<h2 id="org0618871"><span class="section-number-2">4</span> What to do with the result?</h2>
<div class="outline-text-2" id="text-4">
<p>
By default, the selected candidate is returned by <code>ivy-read</code>.  You can optionally
define an <i>action</i> which is called after the selection:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #b2b2b2; font-style: italic;">; </span><span style="color: #b2b2b2; font-style: italic;">Browse files and open selected file for editing</span>
(ivy-read <span style="color: #ff1f8b;">"pick file: "</span>
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> (split-string
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  (shell-command-to-string <span style="color: #ff1f8b;">"ls"</span>) <span style="color: #ff1f8b;">"\n"</span>)
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> <span style="color: #b218b2;">:action</span> (<span style="color: #00af00;">lambda</span> (filename)
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   (find-file filename)))
</pre>
</div>

<p>
Selecting a candidate will now open the respective file.
</p>
</div>
</div>

<div id="outline-container-orge75377f" class="outline-2">
<h2 id="orge75377f"><span class="section-number-2">5</span> "Real world" example</h2>
<div class="outline-text-2" id="text-5">
<p>
In my current job, I need to frequently access a huge csv-file which has a
human-readable name in the first column and an identifier in the second
column. It could be something like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00af00;">setq</span> my-csv-file
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> (make-temp-file <span style="color: #ff1f8b;">"csv"</span> nil nil
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> (concat
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  <span style="color: #ff1f8b;">"NAME;ID\n"</span>
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  <span style="color: #ff1f8b;">"Brand 1;0\n"</span>
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  <span style="color: #ff1f8b;">"Brand 2;12\n"</span>
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  <span style="color: #ff1f8b;">"Brand 3;25"</span>)))

(shell-command-to-string
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>(concat <span style="color: #ff1f8b;">"cat "</span> my-csv-file))
</pre>
</div>

<pre class="example">
NAME;ID
Brand 1;0
Brand 2;12
Brand 3;25
</pre>


<p>
When I've decided which row I want to explore, I need to read the contents of
another file which can be found with the help of the identifier in the second
column.
</p>

<p>
Let's create some temporary files for this purpose and a function for finding
the correct file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00af00;">setq</span> another-files
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> `((<span style="color: #ff1f8b;">"0"</span> ,(make-temp-file
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  <span style="color: #ff1f8b;">"another"</span> nil nil
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  <span style="color: #ff1f8b;">"Lots of Brand 1 stuff ..."</span>))
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   (<span style="color: #ff1f8b;">"12"</span> ,(make-temp-file
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #ff1f8b;">"another"</span> nil nil
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #ff1f8b;">"Lots of Brand 2 stuff ..."</span>))
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   (<span style="color: #ff1f8b;">"25"</span> ,(make-temp-file
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #ff1f8b;">"another"</span> nil nil
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #ff1f8b;">"Lots of Brand 3 stuff ..."</span>))))

(<span style="color: #00af00;">defun</span> <span style="color: #ef2929;">return-filename</span> (id)
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span> (car (cdr (assoc id another-files))))
</pre>
</div>

<p>
The following function, with help of some common third-party libraries, gets nth
column from a csv-file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00af00;">require</span> '<span style="color: #1f5bff;">dash</span>)
(<span style="color: #00af00;">require</span> '<span style="color: #1f5bff;">s</span>)
(<span style="color: #00af00;">require</span> '<span style="color: #1f5bff;">f</span>)

(<span style="color: #00af00;">defun</span> <span style="color: #ef2929;">csv-nth-column</span> (file sep n)
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span> <span style="color: #cc0000;">"Get n'th column from csv file"</span>
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span> (<span style="color: #00af00;">let</span> ((lines (cdr (s-split <span style="color: #ff1f8b;">"\n"</span> (f-read file)))))
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   (-map (<span style="color: #00af00;">lambda</span> (line) (nth n (s-split sep line)))
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> lines)))
</pre>
</div>

<p>
Then my <code>ivy-read</code> call would look like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(ivy-read <span style="color: #ff1f8b;">"pick a brand to study: "</span>
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> (-zip
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  (csv-nth-column my-csv-file <span style="color: #ff1f8b;">";"</span> 0)
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>  (csv-nth-column my-csv-file <span style="color: #ff1f8b;">";"</span> 1))
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> <span style="color: #b218b2;">:action</span> (<span style="color: #00af00;">lambda</span> (x)
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   (<span style="color: #00af00;">with-help-window</span> <span style="color: #ff1f8b;">"*brand info*"</span>
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span> (<span style="color: #00af00;">with-current-buffer</span> <span style="color: #ff1f8b;">"*brand info*"</span>
<span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   <span style="color: #9e9e9e; background-color: #d7d7af;"> </span>   (insert (f-read (return-filename (cdr x))))))))
</pre>
</div>

<p>
Choosing <code>Branch 1</code> opens another buffer with the text <code>Lots of Brand 1 stuff
...</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: T. Gustafsson</p>
<p class="date">Created: 2020-02-05 Wed 23:49</p>
</div>
</body>
</html>
